MikroElektronika/core_packages/ARM/gcc_clang/def/def/nuvoton/M2354KJFAE/mcu.h
#if defined (SCU_INIT_PNSSET5_VAL) && (SCU_INIT_PNSSET5_VAL & BIT17)
# define QEI1 QEI1_NS
#else
# define QEI1 QEI1_S
#endif

#if defined (SCU_INIT_PNSSET5_VAL) && (SCU_INIT_PNSSET5_VAL & BIT20)
# define ECAP0 ECAP0_NS
#else
# define ECAP0 ECAP0_S
#endif

#if defined (SCU_INIT_PNSSET5_VAL) && (SCU_INIT_PNSSET5_VAL & BIT21)
# define ECAP1 ECAP1_NS
#else
# define ECAP1 ECAP1_S
#endif

#if defined (SCU_INIT_PNSSET5_VAL) && (SCU_INIT_PNSSET5_VAL & BIT25)
# define TRNG TRNG_NS
#else
# define TRNG TRNG_S
#endif

#if defined (SCU_INIT_PNSSET5_VAL) && (SCU_INIT_PNSSET5_VAL & BIT27)
# define LCD LCD_NS
#else
# define LCD LCD_S
#endif

#if defined (SCU_INIT_PNSSET6_VAL) && (SCU_INIT_PNSSET6_VAL & BIT0 )
# define USBD USBD_NS
#else
# define USBD USBD_S
#endif

#if defined (SCU_INIT_PNSSET6_VAL) && (SCU_INIT_PNSSET6_VAL & BIT16)
# define USCI0 USCI0_NS
# define UI2C0 UI2C0_NS
# define USPI0 USPI0_NS
# define UUART0 UUART0_NS

#else
# define USCI0 USCI0_S
# define UI2C0 UI2C0_S
# define USPI0 USPI0_S
# define UUART0 UUART0_S

#endif

#if defined (SCU_INIT_PNSSET6_VAL) && (SCU_INIT_PNSSET6_VAL & BIT17)
# define USCI1 USCI1_NS
# define USPI1 USPI1_NS
# define UI2C1 UI2C1_NS
# define UUART1 UUART1_NS

#else
# define USCI1 USCI1_S
# define USPI1 USPI1_S
# define UI2C1 UI2C1_S
# define UUART1 UUART1_S
#endif

#define PA  ( (__PC() & NS_OFFSET) ? PA_NS : PA_S)
#define PB  ( (__PC() & NS_OFFSET) ? PB_NS : PB_S)
#define PC  ( (__PC() & NS_OFFSET) ? PC_NS : PC_S)
#define PD  ( (__PC() & NS_OFFSET) ? PD_NS : PD_S)
#define PE  ( (__PC() & NS_OFFSET) ? PE_NS : PE_S)
#define PF  ( (__PC() & NS_OFFSET) ? PF_NS : PF_S)
#define PG  ( (__PC() & NS_OFFSET) ? PG_NS : PG_S)
#define PH  ( (__PC() & NS_OFFSET) ? PH_NS : PH_S)

/**@}*/ /* end of group PMODULE_SNS */

/**@}*/ /* end of group PMODULE */

/* --------------------  End of section using anonymous unions  ------------------- */
#if   defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
/* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

#ifdef __cplusplus
}
#endif



/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/
#include "sys.h"
#include "clk.h"
// #include "dac.h"
// #include "eadc.h"
// #include "ebi.h"
// #include "ecap.h"
#include "fmc.h"
#include "gpio.h"
// #include "i2c.h"
// #include "i2s.h"
// #include "bpwm.h"
// #include "epwm.h"
// #include "qspi.h"
// #include "spi.h"
// #include "timer.h"
// #include "timer_pwm.h"
// #include "wdt.h"
// #include "wwdt.h"
#include "rtc.h"
// #include "uart.h"
// #include "acmp.h"
// #include "crc.h"
// #include "usbd.h"
// #include "otg.h"
// #include "pdma.h"
// #include "ebi.h"
// #include "keystore.h"
// #include "crypto.h"
// #include "sc.h"
// #include "scuart.h"
// #include "usci_spi.h"
// #include "usci_uart.h"
// #include "usci_i2c.h"
// #include "sdh.h"
// #include "qei.h"
// #include "can.h"
// #include "scu.h"
// #include "tamper.h"
// #include "rng.h"
// #include "dpm.h"
// #include "fvc.h"
// #include "ewwdt.h"
// #include "ewdt.h"
// #include "plm.h"
// #include "lcd.h"

#endif  /* __M2354_H__ */

